Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg51/svd/ATSAMG51N18.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378G</version>
         <description>General Purpose Backup Registers</description>
         <groupName>GPBR</groupName>
         <prependToName>GPBR_</prependToName>
         <baseAddress>0x400E1490</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of GPBR x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>MATRIX</name>
         <version>11049E</version>
         <description>AHB Bus Matrix</description>
         <groupName>MATRIX</groupName>
         <prependToName>MATRIX_</prependToName>
         <baseAddress>0x400E0200</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1EC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>3</dim>
               <dimIncrement>4</dimIncrement>
               <name>MCFG[%s]</name>
               <description>Master Configuration Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ULBT</name>
                     <description>Undefined Length Burst Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ULBTSelect</name>
                        <enumeratedValue>
                           <name>INFINITE</name>
                           <description>No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_BEAT</name>
                           <description>The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIGHT_BEAT</name>
                           <description>The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIXTEEN_BEAT</name>
                           <description>The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCFG[%s]</name>
               <description>Slave Configuration Register 0</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SLOT_CYCLE</name>
                     <description>Maximum Number of Allowed Cycles for a Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DEFMSTR_TYPE</name>
                     <description>Default Master Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEFMSTR_TYPESelect</name>
                        <enumeratedValue>
                           <name>NO_DEFAULT</name>
                           <description>At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST</name>
                           <description>At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXED_DEFMSTR</name>
                     <description>Fixed Default Master</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRAS0</name>
               <description>Priority Register A for Slave 0</description>
               <addressOffset>0x0080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRAS1</name>
               <description>Priority Register A for Slave 1</description>
               <addressOffset>0x0088</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRAS2</name>
               <description>Priority Register A for Slave 2</description>
               <addressOffset>0x0090</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRAS3</name>
               <description>Priority Register A for Slave 3</description>
               <addressOffset>0x0098</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>M0PR</name>
                     <description>Master 0 Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M1PR</name>
                     <description>Master 1 Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M2PR</name>
                     <description>Master 2 Priority</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>M3PR</name>
                     <description>Master 3 Priority</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_SYSIO</name>
               <description>System I/O Configuration Register</description>
               <addressOffset>0x0114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SYSIO4</name>
                     <description>PB4 or TDI Assignment</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO5</name>
                     <description>PB5 or TDO/TRACESWO Assignment</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO6</name>
                     <description>PB6 or TMS/SWDIO Assignment</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO7</name>
                     <description>PB7 or TCK/SWCLK Assignment</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSIO12</name>
                     <description>PB12 or ERASE Assignment</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x1E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x4D4154</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x1E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
