Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg51/svd/ATSAMG51N18.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MEM2MEM</name>
         <version>11211B</version>
         <description>Memory to Memory</description>
         <groupName>MEM2MEM</groupName>
         <prependToName>MEM2MEM_</prependToName>
         <baseAddress>0x40028000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x128</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MEM2MEM</name>
            <value>15</value>
         </interrupt>
         <registers>
            <register>
               <name>THR</name>
               <description>Memory to Memory Transfer Holding Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>THDATA</name>
                     <description>Transfer Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Memory to Memory Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TSIZE</name>
                     <description>Transfer Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TSIZESelect</name>
                        <enumeratedValue>
                           <name>T_8BIT</name>
                           <description>The buffer size is defined in byte.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T_16BIT</name>
                           <description>The buffer size is defined in half-word (16-bit).</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T_32BIT</name>
                           <description>The buffer size is defined in word (32-bit). Default value.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Memory to Memory Interrupt Enable Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXEND</name>
                     <description>End of Transfer Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Buffer Full Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Memory to Memory Interrupt Disable Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXEND</name>
                     <description>End of Transfer Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Buffer Full Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Memory to Memory Interrupt Mask Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXEND</name>
                     <description>End of Transfer Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Buffer Full Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>Memory to Memory Interrupt Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXEND</name>
                     <description>End of Transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Buffer Full</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPR</name>
               <description>Receive Pointer Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXPTR</name>
                     <description>Receive Pointer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCR</name>
               <description>Receive Counter Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXCTR</name>
                     <description>Receive Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPR</name>
               <description>Transmit Pointer Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXPTR</name>
                     <description>Transmit Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR</name>
               <description>Transmit Counter Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXCTR</name>
                     <description>Transmit Counter Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNPR</name>
               <description>Receive Next Pointer Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNPTR</name>
                     <description>Receive Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNCR</name>
               <description>Receive Next Counter Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXNCTR</name>
                     <description>Receive Next Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TNPR</name>
               <description>Transmit Next Pointer Register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXNPTR</name>
                     <description>Transmit Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TNCR</name>
               <description>Transmit Next Counter Register</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXNCTR</name>
                     <description>Transmit Counter Next</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTCR</name>
               <description>Transfer Control Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTDIS</name>
                     <description>Receiver Transfer Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTDIS</name>
                     <description>Transmitter Transfer Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PTSR</name>
               <description>Transfer Status Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
