Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.5.65/samg51/svd/ATSAMG51N18.svd
            <register>
               <name>NVICIP59</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033b</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI59</name>
                     <description>Priority of interrupt 59</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP60</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033c</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI60</name>
                     <description>Priority of interrupt 60</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP61</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033d</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI61</name>
                     <description>Priority of interrupt 61</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP62</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033e</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI62</name>
                     <description>Priority of interrupt 62</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP63</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033f</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI63</name>
                     <description>Priority of interrupt 63</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP64</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000340</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI64</name>
                     <description>Priority of interrupt 64</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP65</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000341</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI65</name>
                     <description>Priority of interrupt 65</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP66</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000342</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI66</name>
                     <description>Priority of interrupt 66</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP67</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000343</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI67</name>
                     <description>Priority of interrupt 67</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP68</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000344</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI68</name>
                     <description>Priority of interrupt 68</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP69</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000345</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI69</name>
                     <description>Priority of interrupt 69</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP70</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000346</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI70</name>
                     <description>Priority of interrupt 70</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP71</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000347</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI71</name>
                     <description>Priority of interrupt 71</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP72</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000348</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI72</name>
                     <description>Priority of interrupt 72</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP73</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000349</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI73</name>
                     <description>Priority of interrupt 73</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP74</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000034a</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI74</name>
                     <description>Priority of interrupt 74</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP75</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000034b</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI75</name>
                     <description>Priority of interrupt 75</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP76</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000034c</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI76</name>
                     <description>Priority of interrupt 76</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP77</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000034d</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI77</name>
                     <description>Priority of interrupt 77</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP78</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000034e</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI78</name>
                     <description>Priority of interrupt 78</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP79</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000034f</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI79</name>
                     <description>Priority of interrupt 79</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP80</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000350</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI80</name>
                     <description>Priority of interrupt 80</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP81</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000351</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI81</name>
                     <description>Priority of interrupt 81</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP82</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000352</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI82</name>
                     <description>Priority of interrupt 82</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP83</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000353</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI83</name>
                     <description>Priority of interrupt 83</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP84</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000354</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI84</name>
                     <description>Priority of interrupt 84</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP85</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000355</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI85</name>
                     <description>Priority of interrupt 85</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP86</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000356</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI86</name>
                     <description>Priority of interrupt 86</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP87</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000357</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI87</name>
                     <description>Priority of interrupt 87</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP88</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000358</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI88</name>
                     <description>Priority of interrupt 88</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP89</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000359</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI89</name>
                     <description>Priority of interrupt 89</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP90</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000035a</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI90</name>
                     <description>Priority of interrupt 90</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP91</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000035b</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI91</name>
                     <description>Priority of interrupt 91</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP92</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000035c</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI92</name>
                     <description>Priority of interrupt 92</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP93</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000035d</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI93</name>
                     <description>Priority of interrupt 93</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP94</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000035e</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI94</name>
                     <description>Priority of interrupt 94</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP95</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000035f</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI95</name>
                     <description>Priority of interrupt 95</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP96</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000360</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI96</name>
                     <description>Priority of interrupt 96</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP97</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000361</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI97</name>
                     <description>Priority of interrupt 97</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP98</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000362</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI98</name>
                     <description>Priority of interrupt 98</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
